Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D22.atdf
          <instance name="UART2">
            <register-group address-space="base" name="UART2" name-in-module="UART" offset="0xF8024000"/>
            <parameters>
              <param name="INSTANCE_ID" value="26"/>
              <param name="CLOCK_ID" value="26"/>
              <param name="DMAC_ID_TX" value="39"/>
              <param name="DMAC_ID_RX" value="40"/>
              <param name="BRSRCCK_PERIPH_CLK" value="0" caption="MCK"/>
              <param name="BRSRCCK_GCLK" value="0" caption="GCLK"/>
            </parameters>
            <signals>
              <signal pad="PD4" function="B" group="URXD" index="2"/>
              <signal pad="PD19" function="C" group="URXD" index="2"/>
              <signal pad="PD23" function="A" group="URXD" index="2"/>
              <signal pad="PD5" function="B" group="UTXD" index="2"/>
              <signal pad="PD20" function="C" group="UTXD" index="2"/>
              <signal pad="PD24" function="A" group="UTXD" index="2"/>
            </signals>
          </instance>
          <instance name="UART3">
            <register-group address-space="base" name="UART3" name-in-module="UART" offset="0xFC008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="27"/>
              <param name="CLOCK_ID" value="27"/>
              <param name="DMAC_ID_TX" value="41"/>
              <param name="DMAC_ID_RX" value="42"/>
              <param name="BRSRCCK_PERIPH_CLK" value="0" caption="MCK"/>
              <param name="BRSRCCK_GCLK" value="0" caption="GCLK"/>
            </parameters>
            <signals>
              <signal pad="PB11" function="C" group="URXD" index="3"/>
              <signal pad="PC12" function="D" group="URXD" index="3"/>
              <signal pad="PC31" function="C" group="URXD" index="3"/>
              <signal pad="PB12" function="C" group="UTXD" index="3"/>
              <signal pad="PC13" function="D" group="UTXD" index="3"/>
              <signal pad="PD0" function="C" group="UTXD" index="3"/>
            </signals>
          </instance>
          <instance name="UART4">
            <register-group address-space="base" name="UART4" name-in-module="UART" offset="0xFC00C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="28"/>
              <param name="CLOCK_ID" value="28"/>
              <param name="DMAC_ID_TX" value="43"/>
              <param name="DMAC_ID_RX" value="44"/>
              <param name="BRSRCCK_PERIPH_CLK" value="0" caption="MCK"/>
              <param name="BRSRCCK_GCLK" value="0" caption="GCLK"/>
            </parameters>
            <signals>
              <signal pad="PB3" function="A" group="URXD" index="4"/>
              <signal pad="PB4" function="A" group="UTXD" index="4"/>
            </signals>
          </instance>
        </module>
        <module name="UDPHS" id="6227" version="V">
          <instance name="UDPHS">
            <register-group address-space="base" name="UDPHS" name-in-module="UDPHS" offset="0xFC02C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="42"/>
              <param name="CLOCK_ID" value="42"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="6080" version="N">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0xF8048040"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="XDMAC" id="11161" version="M">
          <instance name="XDMAC0">
            <register-group address-space="base" name="XDMAC0" name-in-module="XDMAC" offset="0xF0010000"/>
            <parameters>
              <param name="INSTANCE_ID" value="6"/>
              <param name="CLOCK_ID" value="6"/>
            </parameters>
          </instance>
          <instance name="XDMAC1">
            <register-group address-space="base" name="XDMAC1" name-in-module="XDMAC" offset="0xF0004000"/>
            <parameters>
              <param name="INSTANCE_ID" value="7"/>
              <param name="CLOCK_ID" value="7"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt index="0" module-instance="SAIC" name="SAIC" caption="FIQ Internal Interrupt Request"/>
        <interrupt index="2" module-instance="PMU" name="PMU" caption="Internal Performance Monitor Unit"/>
        <interrupt index="3" module-instance="PIT" name="PIT" caption="Periodic Interval Timer Interrupt"/>
        <interrupt index="4" module-instance="WDT" name="WDT" caption="Watchdog Timer Interrupt"/>
        <interrupt index="5" module-instance="GMAC" name="GMAC" caption="Ethernet MAC"/>
        <interrupt index="6" module-instance="XDMAC0" name="XDMAC0" caption="DMA Controller 0"/>
        <interrupt index="7" module-instance="XDMAC1" name="XDMAC1" caption="DMA Controller 1"/>
        <interrupt index="8" module-instance="ICM" name="ICM" caption="Integritry Check Monitor"/>
        <interrupt index="9" module-instance="AES" name="AES" caption="Advanced Enion Standard"/>
        <interrupt index="10" module-instance="AESB" name="AESB" caption="AES Bridge"/>
        <interrupt index="11" module-instance="TDES" name="TDES" caption="Triple Data Enion Standard"/>
        <interrupt index="12" module-instance="SHA" name="SHA" caption="SHA Signature"/>
        <interrupt index="13" module-instance="MPDDRC" name="MPDDRC" caption="MPDDR Controller"/>
        <interrupt index="14" module-instance="MATRIX1" name="MATRIX1" caption="H32MX, 32-bit AHB Matrix"/>
        <interrupt index="15" module-instance="MATRIX0" name="MATRIX0" caption="H64MX, 64-bit AHB Matrix"/>
        <interrupt index="16" module-instance="SECUMOD" name="SECUMOD" caption="Secure Module"/>
        <interrupt index="17" module-instance="HSMC" name="HSMC" caption="Multibit ECC Interrupt"/>
        <interrupt index="18" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller"/>
        <interrupt index="19" module-instance="FLEXCOM0" name="FLEXCOM0" caption="FLEXCOM 0"/>
        <interrupt index="20" module-instance="FLEXCOM1" name="FLEXCOM1" caption="FLEXCOM 1"/>
        <interrupt index="22" module-instance="FLEXCOM3" name="FLEXCOM3" caption="FLEXCOM 3"/>
        <interrupt index="23" module-instance="FLEXCOM4" name="FLEXCOM4" caption="FLEXCOM 4"/>
        <interrupt index="24" module-instance="UART0" name="UART0" caption="UART 0"/>
        <interrupt index="25" module-instance="UART1" name="UART1" caption="UART 1"/>
        <interrupt index="26" module-instance="UART2" name="UART2" caption="UART 2"/>
        <interrupt index="27" module-instance="UART3" name="UART3" caption="UART 3"/>
        <interrupt index="28" module-instance="UART4" name="UART4" caption="UART 4"/>
        <interrupt index="29" module-instance="TWIHS0" name="TWIHS0" caption="Two-Wire Interface 0"/>
        <interrupt index="30" module-instance="TWIHS1" name="TWIHS1" caption="Two-Wire Interface 1"/>
        <interrupt index="32" module-instance="SDMMC1" name="SDMMC1" caption="Secure Data Memory Card Controller 1"/>
        <interrupt index="33" module-instance="SPI0" name="SPI0" caption="Serial Peripheral Interface 0"/>
        <interrupt index="34" module-instance="SPI1" name="SPI1" caption="Serial Peripheral Interface 1"/>
        <interrupt index="35" module-instance="TC0" name="TC0" caption="Timer Counter 0 (ch. 0, 1, 2)"/>
        <interrupt index="36" module-instance="TC1" name="TC1" caption="Timer Counter 1 (ch. 3, 4, 5)"/>
        <interrupt index="38" module-instance="PWM" name="PWM" caption="Pulse Width Modulation Controller0 (ch. 0, 1, 2, 3)"/>
        <interrupt index="40" module-instance="ADC" name="ADC" caption="Touch Screen ADC Controller"/>
        <interrupt index="41" module-instance="UHPHS" name="UHPHS" caption="USB Host High Speed"/>
        <interrupt index="42" module-instance="UDPHS" name="UDPHS" caption="USB Device High Speed"/>
        <interrupt index="43" module-instance="SSC0" name="SSC0" caption="Synchronous Serial Controller 0"/>
        <interrupt index="44" module-instance="SSC1" name="SSC1" caption="Synchronous Serial Controller 1"/>
        <interrupt index="45" module-instance="LCDC" name="LCDC" caption="LCD Controller"/>
        <interrupt index="46" module-instance="ISC" name="ISC" caption="Camera Interface"/>
        <interrupt index="47" module-instance="TRNG" name="TRNG" caption="True Random Number Generator"/>
        <interrupt index="48" module-instance="PDMIC" name="PDMIC" caption="Pulse Density Modulation Interface Controller"/>
        <interrupt index="49" module-instance="AIC" name="AIC" caption="IRQ Internal Interrupt Request"/>
        <interrupt index="50" module-instance="SFC" name="SFC" caption="Fuse Controller"/>
        <interrupt index="51" module-instance="SECURAM" name="SECURAM" caption="Secured RAM"/>
        <interrupt index="52" module-instance="QSPI0" name="QSPI0" caption="QSPI 0"/>
        <interrupt index="53" module-instance="QSPI1" name="QSPI1" caption="QSPI 1"/>
        <interrupt index="54" module-instance="I2SC0" name="I2SC0" caption="Inter-IC Sound Controller 0"/>
        <interrupt index="55" module-instance="I2SC1" name="I2SC1" caption="Inter-IC Sound Controller 1"/>
        <interrupt index="56" module-instance="MCAN0" name="MCAN0_INT0" caption="Internal MCAN 0 Interrupt 0"/>
        <interrupt index="58" module-instance="PTC" name="PTC" caption="Peripheral Touch Controller"/>
        <interrupt index="59" module-instance="CLASSD" name="CLASSD" caption="Audio Class D amplifier"/>
        <interrupt index="63" module-instance="L2CC" name="L2CC" caption="L2 Cache Controller"/>
        <interrupt index="64" module-instance="MCAN0" name="MCAN0_INT1" caption="Internal MCAN 0 Interrupt 1"/>
        <interrupt index="66" module-instance="GMAC" name="GMAC_Q1" caption="GMAC Queue 1 Interrupt"/>
        <interrupt index="67" module-instance="GMAC" name="GMAC_Q2" caption="GMAC Queue 2 Interrupt"/>
        <interrupt index="68" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller"/>
        <interrupt index="69" module-instance="PIOC" name="PIOC" caption="Parallel I/O Controller"/>
        <interrupt index="70" module-instance="PIOD" name="PIOD" caption="Parallel I/O Controller"/>
        <interrupt index="72" module-instance="SDMMC1" name="SDMMC1_TIMER" caption="Secure Digital MultiMedia Card 1 Timer"/>
        <interrupt index="74" module-instance="PMC RSTC RTC" name="SYSC" caption="System Controller Interrupt"/>
        <interrupt index="75" module-instance="ACC" name="ACC" caption="Analog Comparator"/>
        <interrupt index="76" module-instance="RXLP" name="RXLP" caption="Uart Low Power"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B3F03F"/>
          <property name="CHIPID_CIDR" value="0x8A5C08C0"/>
          <property name="CHIPID_EXID" value="0x00000002"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Analog Comparator Controller" id="6490" name="ACC" version="M">
      <register-group name="ACC">
        <register caption="Control Register" name="ACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="ACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Analog Comparator Enable" mask="0x00000100" name="ACEN" values="ACC_MR__ACEN"/>
          <bitfield caption="Invert Comparator Output" mask="0x00001000" name="INV" values="ACC_MR__INV"/>
        </register>
        <register caption="Write Protection Mode Register" name="ACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ACC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
        </register>
      </register-group>
      <value-group caption="Analog Comparator Enable" name="ACC_MR__ACEN">
        <value caption="Analog comparator disabled." name="DIS" value="0"/>
        <value caption="Analog comparator enabled." name="EN" value="1"/>
      </value-group>
