Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D22.atdf
      <value-group caption="Mono Signal" name="CLASSD_INTPMR__MONO">
        <value caption="The signal is sent stereo to the left and right channels." name="DISABLED" value="0"/>
        <value caption="The same signal is sent on both left and right channels. The sent signal is defined by the MONOMODE field value." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Mono Mode Selection" name="CLASSD_INTPMR__MONOMODE">
        <value caption="(left + right) / 2 is sent on both channels" name="MONOMIX" value="0x0"/>
        <value caption="(left + right) is sent to both channels. If the sum is too high, the result is saturated." name="MONOSAT" value="0x1"/>
        <value caption="THR[15:0] is sent on both left and right channels" name="MONOLEFT" value="0x2"/>
        <value caption="THR[31:16] is sent on both left and right channels" name="MONORIGHT" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="CLASSD_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x434C44"/>
      </value-group>
    </module>
    <module caption="Flexible Serial Communication" id="11268" name="FLEXCOM" version="P">
      <register-group name="FLEXCOM">
        <register caption="FLEXCOM Mode Register" name="FLEX_MR" offset="0x000" rw="RW" size="4">
          <bitfield caption="FLEXCOM Operating Mode" mask="0x00000003" name="OPMODE" values="FLEX_MR__OPMODE"/>
        </register>
        <register caption="FLEXCOM Receive Holding Register" name="FLEX_RHR" offset="0x010" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RXDATA"/>
        </register>
        <register caption="FLEXCOM Transmit Holding Register" name="FLEX_THR" offset="0x020" rw="RW" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TXDATA"/>
        </register>
        <register caption="USART Control Register" name="FLEX_US_CR" offset="0x200" rw="W" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8 0xA 0xB"/>
          <mode name="SPI_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xE" value="0xE"/>
          <bitfield caption="Reset Receiver" mask="0x00000004" modes="DEFAULT" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" modes="DEFAULT" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" modes="DEFAULT" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" modes="DEFAULT" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" modes="DEFAULT" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" modes="DEFAULT" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" modes="DEFAULT" name="RSTSTA"/>
          <bitfield caption="Start Break" mask="0x00000200" modes="DEFAULT" name="STTBRK"/>
          <bitfield caption="Stop Break" mask="0x00000400" modes="DEFAULT" name="STPBRK"/>
          <bitfield caption="Clear TIMEOUT Flag and Start Timeout After Next Character Received" mask="0x00000800" modes="DEFAULT" name="STTTO"/>
          <bitfield caption="Send Address" mask="0x00001000" modes="DEFAULT" name="SENDA"/>
          <bitfield caption="Reset Iterations" mask="0x00002000" modes="DEFAULT" name="RSTIT"/>
          <bitfield caption="Reset Non Acknowledge" mask="0x00004000" modes="DEFAULT" name="RSTNACK"/>
          <bitfield caption="Start Timeout Immediately" mask="0x00008000" modes="DEFAULT" name="RETTO"/>
          <bitfield caption="Request to Send Enable" mask="0x00040000" modes="DEFAULT" name="RTSEN"/>
          <bitfield caption="Request to Send Disable" mask="0x00080000" modes="DEFAULT" name="RTSDIS"/>
          <bitfield caption="Abort LIN Transmission" mask="0x00100000" modes="DEFAULT" name="LINABT"/>
          <bitfield caption="Send LIN Wakeup Signal" mask="0x00200000" modes="DEFAULT" name="LINWKUP"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x01000000" modes="DEFAULT" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x02000000" modes="DEFAULT" name="RXFCLR"/>
          <bitfield caption="Transmit FIFO Lock CLEAR" mask="0x04000000" modes="DEFAULT" name="TXFLCLR"/>
          <bitfield caption="Request to Clear the Comparison Trigger" mask="0x10000000" modes="DEFAULT" name="REQCLR"/>
          <bitfield caption="FIFO Enable" mask="0x40000000" modes="DEFAULT" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x80000000" modes="DEFAULT" name="FIFODIS"/>
          <bitfield caption="Reset Receiver" mask="0x00000004" modes="SPI_MODE" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" modes="SPI_MODE" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" modes="SPI_MODE" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" modes="SPI_MODE" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" modes="SPI_MODE" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" modes="SPI_MODE" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" modes="SPI_MODE" name="RSTSTA"/>
          <bitfield caption="Force SPI Chip Select" mask="0x00040000" modes="SPI_MODE" name="FCS"/>
          <bitfield caption="Release SPI Chip Select" mask="0x00080000" modes="SPI_MODE" name="RCS"/>
        </register>
        <register caption="USART Mode Register" name="FLEX_US_MR" offset="0x204" rw="RW" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8 0xA 0xB"/>
          <mode name="SPI_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xE" value="0xE"/>
          <bitfield caption="USART Mode of Operation" mask="0x0000000F" modes="DEFAULT" name="USART_MODE" values="FLEX_US_MR__USART_MODE"/>
          <bitfield caption="Clock Selection" mask="0x00000030" modes="DEFAULT" name="USCLKS" values="FLEX_US_MR__USCLKS"/>
          <bitfield caption="Character Length" mask="0x000000C0" modes="DEFAULT" name="CHRL" values="FLEX_US_MR__CHRL"/>
          <bitfield caption="Synchronous Mode Select" mask="0x00000100" modes="DEFAULT" name="SYNC"/>
          <bitfield caption="Parity Type" mask="0x00000E00" modes="DEFAULT" name="PAR" values="FLEX_US_MR__PAR"/>
          <bitfield caption="Number of Stop Bits" mask="0x00003000" modes="DEFAULT" name="NBSTOP" values="FLEX_US_MR__NBSTOP"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" modes="DEFAULT" name="CHMODE" values="FLEX_US_MR__CHMODE"/>
          <bitfield caption="Bit Order" mask="0x00010000" modes="DEFAULT" name="MSBF"/>
          <bitfield caption="9-bit Character Length" mask="0x00020000" modes="DEFAULT" name="MODE9"/>
          <bitfield caption="Clock Output Select" mask="0x00040000" modes="DEFAULT" name="CLKO"/>
          <bitfield caption="Oversampling Mode" mask="0x00080000" modes="DEFAULT" name="OVER"/>
          <bitfield caption="Inhibit Non Acknowledge" mask="0x00100000" modes="DEFAULT" name="INACK"/>
          <bitfield caption="Disable Successive NACK" mask="0x00200000" modes="DEFAULT" name="DSNACK"/>
          <bitfield caption="Variable Synchronization of Command/Data Sync Start Frame Delimiter" mask="0x00400000" modes="DEFAULT" name="VAR_SYNC"/>
          <bitfield caption="Inverted Data" mask="0x00800000" modes="DEFAULT" name="INVDATA"/>
          <bitfield caption="Maximum Number of Automatic Iteration" mask="0x07000000" modes="DEFAULT" name="MAX_ITERATION"/>
          <bitfield caption="Receive Line Filter" mask="0x10000000" modes="DEFAULT" name="FILTER"/>
          <bitfield caption="Manchester Encoder/Decoder Enable" mask="0x20000000" modes="DEFAULT" name="MAN"/>
          <bitfield caption="Manchester Synchronization Mode" mask="0x40000000" modes="DEFAULT" name="MODSYNC"/>
          <bitfield caption="Start Frame Delimiter Selector" mask="0x80000000" modes="DEFAULT" name="ONEBIT"/>
          <bitfield caption="USART Mode of Operation" mask="0x0000000F" modes="SPI_MODE" name="USART_MODE" values="FLEX_US_MR_SPI_MODE__USART_MODE"/>
          <bitfield caption="Clock Selection" mask="0x00000030" modes="SPI_MODE" name="USCLKS" values="FLEX_US_MR_SPI_MODE__USCLKS"/>
          <bitfield caption="Character Length" mask="0x000000C0" modes="SPI_MODE" name="CHRL" values="FLEX_US_MR_SPI_MODE__CHRL"/>
          <bitfield caption="SPI Clock Phase" mask="0x00000100" modes="SPI_MODE" name="CPHA"/>
          <bitfield caption="SPI Clock Polarity" mask="0x00010000" modes="SPI_MODE" name="CPOL"/>
          <bitfield caption="Wait Read Data Before Transfer" mask="0x00100000" modes="SPI_MODE" name="WRDBT"/>
        </register>
        <register caption="USART Interrupt Enable Register" name="FLEX_US_IER" offset="0x208" rw="W" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8"/>
          <mode name="SPI_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xE" value="0xE"/>
          <mode name="LIN_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xF" value="0xA 0xB"/>
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" modes="DEFAULT" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Enable" mask="0x00000004" modes="DEFAULT" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" modes="DEFAULT" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" modes="DEFAULT" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" modes="DEFAULT" name="PARE"/>
          <bitfield caption="Timeout Interrupt Enable" mask="0x00000100" modes="DEFAULT" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" modes="DEFAULT" name="TXEMPTY"/>
          <bitfield caption="Max number of Repetitions Reached Interrupt Enable" mask="0x00000400" modes="DEFAULT" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt Enable" mask="0x00002000" modes="DEFAULT" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" modes="DEFAULT" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Enable" mask="0x00400000" modes="DEFAULT" name="CMP"/>
          <bitfield caption="Manchester Error Interrupt Enable" mask="0x01000000" modes="DEFAULT" name="MANE"/>
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" modes="SPI_MODE" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" modes="SPI_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" modes="SPI_MODE" name="OVRE"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" modes="SPI_MODE" name="TXEMPTY"/>
          <bitfield caption="SPI Underrun Error Interrupt Enable" mask="0x00000400" modes="SPI_MODE" name="UNRE"/>
          <bitfield caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" mask="0x00080000" modes="SPI_MODE" name="NSSE"/>
          <bitfield caption="Comparison Interrupt Enable" mask="0x00400000" modes="SPI_MODE" name="CMP"/>
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" modes="LIN_MODE" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" modes="LIN_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" modes="LIN_MODE" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" modes="LIN_MODE" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" modes="LIN_MODE" name="PARE"/>
          <bitfield caption="Timeout Interrupt Enable" mask="0x00000100" modes="LIN_MODE" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" modes="LIN_MODE" name="TXEMPTY"/>
          <bitfield caption="LIN Break Sent or LIN Break Received Interrupt Enable" mask="0x00002000" modes="LIN_MODE" name="LINBK"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received Interrupt Enable" mask="0x00004000" modes="LIN_MODE" name="LINID"/>
          <bitfield caption="LIN Transfer Completed Interrupt Enable" mask="0x00008000" modes="LIN_MODE" name="LINTC"/>
          <bitfield caption="LIN Bus Error Interrupt Enable" mask="0x02000000" modes="LIN_MODE" name="LINBE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error Interrupt Enable" mask="0x04000000" modes="LIN_MODE" name="LINISFE"/>
          <bitfield caption="LIN Identifier Parity Interrupt Enable" mask="0x08000000" modes="LIN_MODE" name="LINIPE"/>
          <bitfield caption="LIN Checksum Error Interrupt Enable" mask="0x10000000" modes="LIN_MODE" name="LINCE"/>
          <bitfield caption="LIN Slave Not Responding Error Interrupt Enable" mask="0x20000000" modes="LIN_MODE" name="LINSNRE"/>
          <bitfield caption="LIN Synch Tolerance Error Interrupt Enable" mask="0x40000000" modes="LIN_MODE" name="LINSTE"/>
          <bitfield caption="LIN Header Timeout Error Interrupt Enable" mask="0x80000000" modes="LIN_MODE" name="LINHTE"/>
        </register>
        <register caption="USART Interrupt Disable Register" name="FLEX_US_IDR" offset="0x20C" rw="W" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8"/>
          <mode name="SPI_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xE" value="0xE"/>
          <mode name="LIN_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xF" value="0xA 0xB"/>
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" modes="DEFAULT" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Disable" mask="0x00000004" modes="DEFAULT" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" modes="DEFAULT" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" modes="DEFAULT" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" modes="DEFAULT" name="PARE"/>
          <bitfield caption="Timeout Interrupt Disable" mask="0x00000100" modes="DEFAULT" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" modes="DEFAULT" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Disable" mask="0x00000400" modes="DEFAULT" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt Disable" mask="0x00002000" modes="DEFAULT" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Disable" mask="0x00080000" modes="DEFAULT" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Disable" mask="0x00400000" modes="DEFAULT" name="CMP"/>
          <bitfield caption="Manchester Error Interrupt Disable" mask="0x01000000" modes="DEFAULT" name="MANE"/>
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" modes="SPI_MODE" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" modes="SPI_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000020" modes="SPI_MODE" name="OVRE"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" modes="SPI_MODE" name="TXEMPTY"/>
          <bitfield caption="SPI Underrun Error Interrupt Disable" mask="0x00000400" modes="SPI_MODE" name="UNRE"/>
          <bitfield caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" mask="0x00080000" modes="SPI_MODE" name="NSSE"/>
          <bitfield caption="Comparison Interrupt Disable" mask="0x00400000" modes="SPI_MODE" name="CMP"/>
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" modes="LIN_MODE" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" modes="LIN_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000020" modes="LIN_MODE" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" modes="LIN_MODE" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" modes="LIN_MODE" name="PARE"/>
          <bitfield caption="Timeout Interrupt Disable" mask="0x00000100" modes="LIN_MODE" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" modes="LIN_MODE" name="TXEMPTY"/>
          <bitfield caption="LIN Break Sent or LIN Break Received Interrupt Disable" mask="0x00002000" modes="LIN_MODE" name="LINBK"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received Interrupt Disable" mask="0x00004000" modes="LIN_MODE" name="LINID"/>
          <bitfield caption="LIN Transfer Completed Interrupt Disable" mask="0x00008000" modes="LIN_MODE" name="LINTC"/>
          <bitfield caption="LIN Bus Error Interrupt Disable" mask="0x02000000" modes="LIN_MODE" name="LINBE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error Interrupt Disable" mask="0x04000000" modes="LIN_MODE" name="LINISFE"/>
          <bitfield caption="LIN Identifier Parity Interrupt Disable" mask="0x08000000" modes="LIN_MODE" name="LINIPE"/>
          <bitfield caption="LIN Checksum Error Interrupt Disable" mask="0x10000000" modes="LIN_MODE" name="LINCE"/>
          <bitfield caption="LIN Slave Not Responding Error Interrupt Disable" mask="0x20000000" modes="LIN_MODE" name="LINSNRE"/>
          <bitfield caption="LIN Synch Tolerance Error Interrupt Disable" mask="0x40000000" modes="LIN_MODE" name="LINSTE"/>
          <bitfield caption="LIN Header Timeout Error Interrupt Disable" mask="0x80000000" modes="LIN_MODE" name="LINHTE"/>
        </register>
        <register caption="USART Interrupt Mask Register" name="FLEX_US_IMR" offset="0x210" rw="R" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8"/>
          <mode name="SPI_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xE" value="0xE"/>
          <mode name="LIN_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xF" value="0xA 0xB"/>
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" modes="DEFAULT" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Mask" mask="0x00000004" modes="DEFAULT" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" modes="DEFAULT" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" modes="DEFAULT" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" modes="DEFAULT" name="PARE"/>
          <bitfield caption="Timeout Interrupt Mask" mask="0x00000100" modes="DEFAULT" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" modes="DEFAULT" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Mask" mask="0x00000400" modes="DEFAULT" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt Mask" mask="0x00002000" modes="DEFAULT" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" modes="DEFAULT" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Mask" mask="0x00400000" modes="DEFAULT" name="CMP"/>
          <bitfield caption="Manchester Error Interrupt Mask" mask="0x01000000" modes="DEFAULT" name="MANE"/>
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" modes="SPI_MODE" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" modes="SPI_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" modes="SPI_MODE" name="OVRE"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" modes="SPI_MODE" name="TXEMPTY"/>
          <bitfield caption="SPI Underrun Error Interrupt Mask" mask="0x00000400" modes="SPI_MODE" name="UNRE"/>
          <bitfield caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event" mask="0x00080000" modes="SPI_MODE" name="NSSE"/>
          <bitfield caption="Comparison Interrupt Mask" mask="0x00400000" modes="SPI_MODE" name="CMP"/>
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" modes="LIN_MODE" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" modes="LIN_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" modes="LIN_MODE" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" modes="LIN_MODE" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" modes="LIN_MODE" name="PARE"/>
          <bitfield caption="Timeout Interrupt Mask" mask="0x00000100" modes="LIN_MODE" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" modes="LIN_MODE" name="TXEMPTY"/>
          <bitfield caption="LIN Break Sent or LIN Break Received Interrupt Mask" mask="0x00002000" modes="LIN_MODE" name="LINBK"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received Interrupt Mask" mask="0x00004000" modes="LIN_MODE" name="LINID"/>
          <bitfield caption="LIN Transfer Completed Interrupt Mask" mask="0x00008000" modes="LIN_MODE" name="LINTC"/>
          <bitfield caption="LIN Bus Error Interrupt Mask" mask="0x02000000" modes="LIN_MODE" name="LINBE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error Interrupt Mask" mask="0x04000000" modes="LIN_MODE" name="LINISFE"/>
          <bitfield caption="LIN Identifier Parity Interrupt Mask" mask="0x08000000" modes="LIN_MODE" name="LINIPE"/>
          <bitfield caption="LIN Checksum Error Interrupt Mask" mask="0x10000000" modes="LIN_MODE" name="LINCE"/>
          <bitfield caption="LIN Slave Not Responding Error Interrupt Mask" mask="0x20000000" modes="LIN_MODE" name="LINSNRE"/>
          <bitfield caption="LIN Synch Tolerance Error Interrupt Mask" mask="0x40000000" modes="LIN_MODE" name="LINSTE"/>
          <bitfield caption="LIN Header Timeout Error Interrupt Mask" mask="0x80000000" modes="LIN_MODE" name="LINHTE"/>
        </register>
