Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D22.atdf
        <register caption="USART Channel Status Register" name="FLEX_US_CSR" offset="0x214" rw="R" size="4">
          <mode name="DEFAULT" qualifier="FLEX_US_MR.USART_MODE" value="0x0 0x1 0x2 0x4 0x6 0x8"/>
          <mode name="SPI_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xE" value="0xE"/>
          <mode name="LIN_MODE" qualifier="FLEX_US_MR.USART_MODE" mask="0xF" value="0xA 0xB"/>
          <bitfield caption="Receiver Ready (cleared by reading FLEX_US_RHR)" mask="0x00000001" modes="DEFAULT" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing FLEX_US_THR)" mask="0x00000002" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Break Received/End of Break" mask="0x00000004" modes="DEFAULT" name="RXBRK"/>
          <bitfield caption="Overrun Error" mask="0x00000020" modes="DEFAULT" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" modes="DEFAULT" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" modes="DEFAULT" name="PARE"/>
          <bitfield caption="Receiver Timeout" mask="0x00000100" modes="DEFAULT" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (cleared by writing FLEX_US_THR)" mask="0x00000200" modes="DEFAULT" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached" mask="0x00000400" modes="DEFAULT" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt" mask="0x00002000" modes="DEFAULT" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Flag" mask="0x00080000" modes="DEFAULT" name="CTSIC"/>
          <bitfield caption="Comparison Status" mask="0x00400000" modes="DEFAULT" name="CMP"/>
          <bitfield caption="Image of CTS Input" mask="0x00800000" modes="DEFAULT" name="CTS"/>
          <bitfield caption="Manchester Error" mask="0x01000000" modes="DEFAULT" name="MANE"/>
          <bitfield caption="Receiver Ready (cleared by reading FLEX_US_RHR)" mask="0x00000001" modes="SPI_MODE" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing FLEX_US_THR)" mask="0x00000002" modes="SPI_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error" mask="0x00000020" modes="SPI_MODE" name="OVRE"/>
          <bitfield caption="Transmitter Empty (cleared by writing FLEX_US_THR)" mask="0x00000200" modes="SPI_MODE" name="TXEMPTY"/>
          <bitfield caption="Underrun Error" mask="0x00000400" modes="SPI_MODE" name="UNRE"/>
          <bitfield caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event (cleared on read)" mask="0x00080000" modes="SPI_MODE" name="NSSE"/>
          <bitfield caption="Comparison Match" mask="0x00400000" modes="SPI_MODE" name="CMP"/>
          <bitfield caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event (cleared on read)" mask="0x00800000" modes="SPI_MODE" name="NSS"/>
          <bitfield caption="Receiver Ready (cleared by reading FLEX_US_RHR)" mask="0x00000001" modes="LIN_MODE" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing FLEX_US_THR)" mask="0x00000002" modes="LIN_MODE" name="TXRDY"/>
          <bitfield caption="Overrun Error" mask="0x00000020" modes="LIN_MODE" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" modes="LIN_MODE" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" modes="LIN_MODE" name="PARE"/>
          <bitfield caption="Receiver Timeout" mask="0x00000100" modes="LIN_MODE" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (cleared by writing FLEX_US_THR)" mask="0x00000200" modes="LIN_MODE" name="TXEMPTY"/>
          <bitfield caption="LIN Break Sent or LIN Break Received" mask="0x00002000" modes="LIN_MODE" name="LINBK"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received" mask="0x00004000" modes="LIN_MODE" name="LINID"/>
          <bitfield caption="LIN Transfer Completed" mask="0x00008000" modes="LIN_MODE" name="LINTC"/>
          <bitfield caption="LIN Bus Line Status" mask="0x00800000" modes="LIN_MODE" name="LINBLS"/>
          <bitfield caption="LIN Bit Error" mask="0x02000000" modes="LIN_MODE" name="LINBE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error" mask="0x04000000" modes="LIN_MODE" name="LINISFE"/>
          <bitfield caption="LIN Identifier Parity Error" mask="0x08000000" modes="LIN_MODE" name="LINIPE"/>
          <bitfield caption="LIN Checksum Error" mask="0x10000000" modes="LIN_MODE" name="LINCE"/>
          <bitfield caption="LIN Slave Not Responding Error" mask="0x20000000" modes="LIN_MODE" name="LINSNRE"/>
          <bitfield caption="LIN Synch Tolerance Error" mask="0x40000000" modes="LIN_MODE" name="LINSTE"/>
          <bitfield caption="LIN Header Timeout Error" mask="0x80000000" modes="LIN_MODE" name="LINHTE"/>
        </register>
        <register caption="USART Receive Holding Register" name="FLEX_US_RHR" offset="0x218" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA"/>
          <bitfield caption="Received Character" mask="0x000001FF" modes="DEFAULT" name="RXCHR"/>
          <bitfield caption="Received Sync" mask="0x00008000" modes="DEFAULT" name="RXSYNH"/>
          <bitfield caption="Received Character" mask="0x000000FF" modes="FIFO_MULTI_DATA" name="RXCHR0"/>
          <bitfield caption="Received Character" mask="0x0000FF00" modes="FIFO_MULTI_DATA" name="RXCHR1"/>
          <bitfield caption="Received Character" mask="0x00FF0000" modes="FIFO_MULTI_DATA" name="RXCHR2"/>
          <bitfield caption="Received Character" mask="0xFF000000" modes="FIFO_MULTI_DATA" name="RXCHR3"/>
        </register>
        <register caption="USART Transmit Holding Register" name="FLEX_US_THR" offset="0x21C" rw="W" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA"/>
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" modes="DEFAULT" name="TXCHR"/>
          <bitfield caption="Sync Field to be Transmitted" mask="0x00008000" modes="DEFAULT" name="TXSYNH"/>
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" modes="FIFO_MULTI_DATA" name="TXCHR0"/>
          <bitfield caption="Character to be Transmitted" mask="0x0000FF00" modes="FIFO_MULTI_DATA" name="TXCHR1"/>
          <bitfield caption="Character to be Transmitted" mask="0x00FF0000" modes="FIFO_MULTI_DATA" name="TXCHR2"/>
          <bitfield caption="Character to be Transmitted" mask="0xFF000000" modes="FIFO_MULTI_DATA" name="TXCHR3"/>
        </register>
