Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D22.atdf
        <register caption="TWI SleepWalking Matching Register" name="FLEX_TWI_SWMR" offset="0x64C" rw="RW" size="4">
          <bitfield caption="Slave Address 1" mask="0x0000007F" name="SADR1"/>
          <bitfield caption="Slave Address 2" mask="0x00007F00" name="SADR2"/>
          <bitfield caption="Slave Address 3" mask="0x007F0000" name="SADR3"/>
          <bitfield caption="Data Match" mask="0xFF000000" name="DATAM"/>
        </register>
        <register caption="TWI FIFO Mode Register" name="FLEX_TWI_FMR" offset="0x650" rw="RW" size="4">
          <bitfield caption="Transmitter Ready Mode" mask="0x00000003" name="TXRDYM" values="FLEX_TWI_FMR__TXRDYM"/>
          <bitfield caption="Receiver Ready Mode" mask="0x00000030" name="RXRDYM" values="FLEX_TWI_FMR__RXRDYM"/>
          <bitfield caption="Transmit FIFO Threshold" mask="0x003F0000" name="TXFTHRES"/>
          <bitfield caption="Receive FIFO Threshold" mask="0x3F000000" name="RXFTHRES"/>
        </register>
        <register caption="TWI FIFO Level Register" name="FLEX_TWI_FLR" offset="0x654" rw="R" size="4">
          <bitfield caption="Transmit FIFO Level" mask="0x0000003F" name="TXFL"/>
          <bitfield caption="Receive FIFO Level" mask="0x003F0000" name="RXFL"/>
        </register>
        <register caption="TWI FIFO Status Register" name="FLEX_TWI_FSR" offset="0x660" rw="R" size="4">
          <bitfield caption="Transmit FIFO Empty Flag (cleared on read)" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="Transmit FIFO Full Flag (cleared on read)" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="Transmit FIFO Threshold Flag (cleared on read)" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="Receive FIFO Empty Flag" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="Receive FIFO Full Flag" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="Receive FIFO Threshold Flag" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="Transmit FIFO Pointer Error Flag" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="Receive FIFO Pointer Error Flag" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="TWI FIFO Interrupt Enable Register" name="FLEX_TWI_FIER" offset="0x664" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Enable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Enable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Enable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Enable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Enable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Enable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Enable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Enable" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="TWI FIFO Interrupt Disable Register" name="FLEX_TWI_FIDR" offset="0x668" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Disable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Disable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Disable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Disable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Disable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Disable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Disable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Disable" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="TWI FIFO Interrupt Mask Register" name="FLEX_TWI_FIMR" offset="0x66C" rw="R" size="4">
          <bitfield caption="TXFEF Interrupt Mask" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Mask" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Mask" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Mask" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Mask" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Mask" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Mask" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Mask" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="TWI Debug Register" name="FLEX_TWI_DR" offset="0x6D0" rw="R" size="4">
          <bitfield caption="SleepWalking Enable" mask="0x00000001" name="SWEN"/>
          <bitfield caption="Clock Request" mask="0x00000002" name="CLKRQ"/>
          <bitfield caption="SleepWalking Match" mask="0x00000004" name="SWMATCH"/>
          <bitfield caption="Transfer Pending" mask="0x00000008" name="TRP"/>
        </register>
        <register caption="TWI Write Protection Mode Register" name="FLEX_TWI_WPMR" offset="0x6E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="FLEX_TWI_WPMR__WPKEY"/>
        </register>
        <register caption="TWI Write Protection Status Register" name="FLEX_TWI_WPSR" offset="0x6E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0xFFFFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="FLEXCOM Operating Mode" name="FLEX_MR__OPMODE">
        <value caption="No communication" name="NO_COM" value="0x0"/>
        <value caption="All UART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN,)SPI/TWI related registers are not accessible and have no impact on IOs." name="USART" value="0x1"/>
        <value caption="SPI operating mode is selected.USART/TWI related registers are not accessible and have no impact on IOs." name="SPI" value="0x2"/>
        <value caption="All TWI related protocols are selected (TWI, SMBus).USART/SPI related registers are not accessible and have no impact on IOs." name="TWI" value="0x3"/>
      </value-group>
      <value-group caption="USART Mode of Operation" name="FLEX_US_MR__USART_MODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="RS485" name="RS485" value="0x1"/>
        <value caption="Hardware handshaking" name="HW_HANDSHAKING" value="0x2"/>
        <value caption="IS07816 Protocol: T = 0" name="IS07816_T_0" value="0x4"/>
        <value caption="IS07816 Protocol: T = 1" name="IS07816_T_1" value="0x6"/>
        <value caption="IrDA" name="IRDA" value="0x8"/>
        <value caption="LIN Master mode" name="LIN_MASTER" value="0xA"/>
        <value caption="LIN Slave mode" name="LIN_SLAVE" value="0xB"/>
        <value caption="SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2)" name="SPI_MASTER" value="0xE"/>
        <value caption="SPI Slave mode" name="SPI_SLAVE" value="0xF"/>
      </value-group>
