Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D22.atdf
      <value-group caption="I/O Line Function" name="S_PIO_CFGR0__FUNC">
        <value caption="Select the PIO mode for the selected I/O lines." name="GPIO" value="0x0"/>
        <value caption="Select the peripheral A for the selected I/O lines." name="PERIPH_A" value="0x1"/>
        <value caption="Select the peripheral B for the selected I/O lines." name="PERIPH_B" value="0x2"/>
        <value caption="Select the peripheral C for the selected I/O lines." name="PERIPH_C" value="0x3"/>
        <value caption="Select the peripheral D for the selected I/O lines." name="PERIPH_D" value="0x4"/>
        <value caption="Select the peripheral E for the selected I/O lines." name="PERIPH_E" value="0x5"/>
        <value caption="Select the peripheral F for the selected I/O lines." name="PERIPH_F" value="0x6"/>
        <value caption="Select the peripheral G for the selected I/O lines." name="PERIPH_G" value="0x7"/>
      </value-group>
      <value-group caption="Direction" name="S_PIO_CFGR0__DIR">
        <value caption="The selected I/O lines are pure inputs." name="INPUT" value="0"/>
        <value caption="The selected I/O lines are enabled in output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="Pull-Up Enable" name="S_PIO_CFGR0__PUEN">
        <value caption="Pull-Up is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Up is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Pull-Down Enable" name="S_PIO_CFGR0__PDEN">
        <value caption="Pull-Down is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Down is enabled for the selected I/O lines only if PUEN is 0." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Input Filter Enable" name="S_PIO_CFGR0__IFEN">
        <value caption="The input filter is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="The input filter is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Open-Drain" name="S_PIO_CFGR0__OPD">
        <value caption="The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level." name="DISABLED" value="0"/>
        <value caption="The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Schmitt Trigger" name="S_PIO_CFGR0__SCHMITT">
        <value caption="Schmitt trigger is enabled for the selected I/O lines." name="ENABLED" value="0"/>
        <value caption="Schmitt trigger is disabled for the selected I/O lines." name="DISABLED" value="1"/>
      </value-group>
      <value-group caption="Drive Strength" name="S_PIO_CFGR0__DRVSTR">
        <value caption="Low drive" name="LO" value="0x0"/>
        <value caption="Medium drive" name="ME" value="0x2"/>
        <value caption="High drive" name="HI" value="0x3"/>
      </value-group>
      <value-group caption="Event Selection" name="S_PIO_CFGR0__EVTSEL">
        <value caption="Event detection on input falling edge" name="FALLING" value="0x0"/>
        <value caption="Event detection on input rising edge" name="RISING" value="0x1"/>
        <value caption="Event detection on input both edge" name="BOTH" value="0x2"/>
        <value caption="Event detection on low level input" name="LOW" value="0x3"/>
        <value caption="Event detection on high level input" name="HIGH" value="0x4"/>
      </value-group>
      <value-group caption="Physical Configuration Freeze Status (read-only)" name="S_PIO_CFGR0__PCFS">
        <value caption="The fields are not frozen and can be written for this I/O line." name="NOT_FROZEN" value="0"/>
        <value caption="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." name="FROZEN" value="1"/>
      </value-group>
      <value-group caption="Interrupt Configuration Freeze Status (read-only)" name="S_PIO_CFGR0__ICFS">
        <value caption="The fields are not frozen and can be written for this I/O line." name="NOT_FROZEN" value="0"/>
        <value caption="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." name="FROZEN" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="S_PIO_IOSSR0__PX">
        <value caption="The I/O line of the I/O group 0 is in Secure mode." name="SECURE" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in Non-Secure mode." name="NON_SECURE" value="1"/>
      </value-group>
      <value-group caption="Freeze Key" name="S_PIO_IOFR0__FRZKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit." name="PASSWD" value="0x494F46"/>
      </value-group>
      <value-group caption="Write Protection Key" name="PIO_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
      <value-group caption="Write Protection Key" name="S_PIO_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
    </module>
    <module caption="Periodic Interval Timer" id="6079" name="PIT" version="C">
      <register-group name="PIT">
        <register caption="Mode Register" name="PIT_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Periodic Interval Value" mask="0x000FFFFF" name="PIV"/>
          <bitfield caption="Period Interval Timer Enabled" mask="0x01000000" name="PITEN"/>
          <bitfield caption="Periodic Interval Timer Interrupt Enable" mask="0x02000000" name="PITIEN"/>
        </register>
