Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D22.atdf
        <register caption="Error Interrupt Status Enable Register" name="SDMMC_EISTER" offset="0x36" rw="RW" size="2">
          <mode name="SD_SDIO"/>
          <mode name="E_MMC"/>
          <bitfield caption="Command Timeout Error Status Enable" mask="0x00000001" modes="SD_SDIO" name="CMDTEO" values="SDMMC_EISTER__CMDTEO"/>
          <bitfield caption="Command CRC Error Status Enable" mask="0x00000002" modes="SD_SDIO" name="CMDCRC" values="SDMMC_EISTER__CMDCRC"/>
          <bitfield caption="Command End Bit Error Status Enable" mask="0x00000004" modes="SD_SDIO" name="CMDEND" values="SDMMC_EISTER__CMDEND"/>
          <bitfield caption="Command Index Error Status Enable" mask="0x00000008" modes="SD_SDIO" name="CMDIDX" values="SDMMC_EISTER__CMDIDX"/>
          <bitfield caption="Data Timeout Error Status Enable" mask="0x00000010" modes="SD_SDIO" name="DATTEO" values="SDMMC_EISTER__DATTEO"/>
          <bitfield caption="Data CRC Error Status Enable" mask="0x00000020" modes="SD_SDIO" name="DATCRC" values="SDMMC_EISTER__DATCRC"/>
          <bitfield caption="Data End Bit Error Status Enable" mask="0x00000040" modes="SD_SDIO" name="DATEND" values="SDMMC_EISTER__DATEND"/>
          <bitfield caption="Current Limit Error Status Enable" mask="0x00000080" modes="SD_SDIO" name="CURLIM" values="SDMMC_EISTER__CURLIM"/>
          <bitfield caption="Auto CMD Error Status Enable" mask="0x00000100" modes="SD_SDIO" name="ACMD" values="SDMMC_EISTER__ACMD"/>
          <bitfield caption="ADMA Error Status Enable" mask="0x00000200" modes="SD_SDIO" name="ADMA" values="SDMMC_EISTER__ADMA"/>
          <bitfield caption="Command Timeout Error Status Enable" mask="0x00000001" modes="E_MMC" name="CMDTEO" values="SDMMC_EISTER_E_MMC__CMDTEO"/>
          <bitfield caption="Command CRC Error Status Enable" mask="0x00000002" modes="E_MMC" name="CMDCRC" values="SDMMC_EISTER_E_MMC__CMDCRC"/>
          <bitfield caption="Command End Bit Error Status Enable" mask="0x00000004" modes="E_MMC" name="CMDEND" values="SDMMC_EISTER_E_MMC__CMDEND"/>
          <bitfield caption="Command Index Error Status Enable" mask="0x00000008" modes="E_MMC" name="CMDIDX" values="SDMMC_EISTER_E_MMC__CMDIDX"/>
          <bitfield caption="Data Timeout Error Status Enable" mask="0x00000010" modes="E_MMC" name="DATTEO" values="SDMMC_EISTER_E_MMC__DATTEO"/>
          <bitfield caption="Data CRC Error Status Enable" mask="0x00000020" modes="E_MMC" name="DATCRC" values="SDMMC_EISTER_E_MMC__DATCRC"/>
          <bitfield caption="Data End Bit Error Status Enable" mask="0x00000040" modes="E_MMC" name="DATEND" values="SDMMC_EISTER_E_MMC__DATEND"/>
          <bitfield caption="Current Limit Error Status Enable" mask="0x00000080" modes="E_MMC" name="CURLIM" values="SDMMC_EISTER_E_MMC__CURLIM"/>
          <bitfield caption="Auto CMD Error Status Enable" mask="0x00000100" modes="E_MMC" name="ACMD" values="SDMMC_EISTER_E_MMC__ACMD"/>
          <bitfield caption="ADMA Error Status Enable" mask="0x00000200" modes="E_MMC" name="ADMA" values="SDMMC_EISTER_E_MMC__ADMA"/>
          <bitfield caption="Boot Acknowledge Error Status Enable" mask="0x00001000" modes="E_MMC" name="BOOTAE" values="SDMMC_EISTER_E_MMC__BOOTAE"/>
        </register>
        <register caption="Normal Interrupt Signal Enable Register" name="SDMMC_NISIER" offset="0x38" rw="RW" size="2">
          <mode name="SD_SDIO"/>
          <mode name="E_MMC"/>
          <bitfield caption="Command Complete Signal Enable" mask="0x00000001" modes="SD_SDIO" name="CMDC" values="SDMMC_NISIER__CMDC"/>
          <bitfield caption="Transfer Complete Signal Enable" mask="0x00000002" modes="SD_SDIO" name="TRFC" values="SDMMC_NISIER__TRFC"/>
          <bitfield caption="Block Gap Event Signal Enable" mask="0x00000004" modes="SD_SDIO" name="BLKGE" values="SDMMC_NISIER__BLKGE"/>
          <bitfield caption="DMA Interrupt Signal Enable" mask="0x00000008" modes="SD_SDIO" name="DMAINT" values="SDMMC_NISIER__DMAINT"/>
          <bitfield caption="Buffer Write Ready Signal Enable" mask="0x00000010" modes="SD_SDIO" name="BWRRDY" values="SDMMC_NISIER__BWRRDY"/>
          <bitfield caption="Buffer Read Ready Signal Enable" mask="0x00000020" modes="SD_SDIO" name="BRDRDY" values="SDMMC_NISIER__BRDRDY"/>
          <bitfield caption="Card Insertion Signal Enable" mask="0x00000040" modes="SD_SDIO" name="CINS" values="SDMMC_NISIER__CINS"/>
          <bitfield caption="Card Removal Signal Enable" mask="0x00000080" modes="SD_SDIO" name="CREM" values="SDMMC_NISIER__CREM"/>
          <bitfield caption="Card Interrupt Signal Enable" mask="0x00000100" modes="SD_SDIO" name="CINT" values="SDMMC_NISIER__CINT"/>
          <bitfield caption="Command Complete Signal Enable" mask="0x00000001" modes="E_MMC" name="CMDC" values="SDMMC_NISIER_E_MMC__CMDC"/>
          <bitfield caption="Transfer Complete Signal Enable" mask="0x00000002" modes="E_MMC" name="TRFC" values="SDMMC_NISIER_E_MMC__TRFC"/>
          <bitfield caption="Block Gap Event Signal Enable" mask="0x00000004" modes="E_MMC" name="BLKGE" values="SDMMC_NISIER_E_MMC__BLKGE"/>
          <bitfield caption="DMA Interrupt Signal Enable" mask="0x00000008" modes="E_MMC" name="DMAINT" values="SDMMC_NISIER_E_MMC__DMAINT"/>
          <bitfield caption="Buffer Write Ready Signal Enable" mask="0x00000010" modes="E_MMC" name="BWRRDY" values="SDMMC_NISIER_E_MMC__BWRRDY"/>
          <bitfield caption="Buffer Read Ready Signal Enable" mask="0x00000020" modes="E_MMC" name="BRDRDY" values="SDMMC_NISIER_E_MMC__BRDRDY"/>
          <bitfield caption="Boot Acknowledge Received Signal Enable" mask="0x00004000" modes="E_MMC" name="BOOTAR" values="SDMMC_NISIER_E_MMC__BOOTAR"/>
        </register>
        <register caption="Error Interrupt Signal Enable Register" name="SDMMC_EISIER" offset="0x3A" rw="RW" size="2">
          <mode name="SD_SDIO"/>
          <mode name="E_MMC"/>
          <bitfield caption="Command Timeout Error Signal Enable" mask="0x00000001" modes="SD_SDIO" name="CMDTEO" values="SDMMC_EISIER__CMDTEO"/>
          <bitfield caption="Command CRC Error Signal Enable" mask="0x00000002" modes="SD_SDIO" name="CMDCRC" values="SDMMC_EISIER__CMDCRC"/>
          <bitfield caption="Command End Bit Error Signal Enable" mask="0x00000004" modes="SD_SDIO" name="CMDEND" values="SDMMC_EISIER__CMDEND"/>
          <bitfield caption="Command Index Error Signal Enable" mask="0x00000008" modes="SD_SDIO" name="CMDIDX" values="SDMMC_EISIER__CMDIDX"/>
          <bitfield caption="Data Timeout Error Signal Enable" mask="0x00000010" modes="SD_SDIO" name="DATTEO" values="SDMMC_EISIER__DATTEO"/>
          <bitfield caption="Data CRC Error Signal Enable" mask="0x00000020" modes="SD_SDIO" name="DATCRC" values="SDMMC_EISIER__DATCRC"/>
          <bitfield caption="Data End Bit Error Signal Enable" mask="0x00000040" modes="SD_SDIO" name="DATEND" values="SDMMC_EISIER__DATEND"/>
          <bitfield caption="Current Limit Error Signal Enable" mask="0x00000080" modes="SD_SDIO" name="CURLIM" values="SDMMC_EISIER__CURLIM"/>
          <bitfield caption="Auto CMD Error Signal Enable" mask="0x00000100" modes="SD_SDIO" name="ACMD" values="SDMMC_EISIER__ACMD"/>
          <bitfield caption="ADMA Error Signal Enable" mask="0x00000200" modes="SD_SDIO" name="ADMA" values="SDMMC_EISIER__ADMA"/>
          <bitfield caption="Command Timeout Error Signal Enable" mask="0x00000001" modes="E_MMC" name="CMDTEO" values="SDMMC_EISIER_E_MMC__CMDTEO"/>
          <bitfield caption="Command CRC Error Signal Enable" mask="0x00000002" modes="E_MMC" name="CMDCRC" values="SDMMC_EISIER_E_MMC__CMDCRC"/>
          <bitfield caption="Command End Bit Error Signal Enable" mask="0x00000004" modes="E_MMC" name="CMDEND" values="SDMMC_EISIER_E_MMC__CMDEND"/>
          <bitfield caption="Command Index Error Signal Enable" mask="0x00000008" modes="E_MMC" name="CMDIDX" values="SDMMC_EISIER_E_MMC__CMDIDX"/>
          <bitfield caption="Data Timeout Error Signal Enable" mask="0x00000010" modes="E_MMC" name="DATTEO" values="SDMMC_EISIER_E_MMC__DATTEO"/>
          <bitfield caption="Data CRC Error Signal Enable" mask="0x00000020" modes="E_MMC" name="DATCRC" values="SDMMC_EISIER_E_MMC__DATCRC"/>
          <bitfield caption="Data End Bit Error Signal Enable" mask="0x00000040" modes="E_MMC" name="DATEND" values="SDMMC_EISIER_E_MMC__DATEND"/>
          <bitfield caption="Current Limit Error Signal Enable" mask="0x00000080" modes="E_MMC" name="CURLIM" values="SDMMC_EISIER_E_MMC__CURLIM"/>
          <bitfield caption="Auto CMD Error Signal Enable" mask="0x00000100" modes="E_MMC" name="ACMD" values="SDMMC_EISIER_E_MMC__ACMD"/>
          <bitfield caption="ADMA Error Signal Enable" mask="0x00000200" modes="E_MMC" name="ADMA" values="SDMMC_EISIER_E_MMC__ADMA"/>
          <bitfield caption="Boot Acknowledge Error Signal Enable" mask="0x00001000" modes="E_MMC" name="BOOTAE" values="SDMMC_EISIER_E_MMC__BOOTAE"/>
        </register>
        <register caption="Auto CMD Error Status Register" name="SDMMC_ACESR" offset="0x3C" rw="R" size="2">
          <bitfield caption="Auto CMD12 Not Executed" mask="0x00000001" name="ACMD12NE"/>
          <bitfield caption="Auto CMD Timeout Error" mask="0x00000002" name="ACMDTEO"/>
          <bitfield caption="Auto CMD CRC Error" mask="0x00000004" name="ACMDCRC"/>
          <bitfield caption="Auto CMD End Bit Error" mask="0x00000008" name="ACMDEND"/>
          <bitfield caption="Auto CMD Index Error" mask="0x00000010" name="ACMDIDX"/>
          <bitfield caption="Command Not Issued by Auto CMD12 Error" mask="0x00000080" name="CMDNI"/>
        </register>
        <register caption="Host Control 2 Register" name="SDMMC_HC2R" offset="0x3E" rw="RW" size="2">
          <mode name="SD_SDIO"/>
          <mode name="E_MMC"/>
          <bitfield caption="UHS Mode Select" mask="0x00000007" modes="SD_SDIO" name="UHSMS" values="SDMMC_HC2R__UHSMS"/>
          <bitfield caption="1.8V Signaling Enable" mask="0x00000008" modes="SD_SDIO" name="VS18EN"/>
          <bitfield caption="Driver Strength Select" mask="0x00000030" modes="SD_SDIO" name="DRVSEL" values="SDMMC_HC2R__DRVSEL"/>
          <bitfield caption="Execute Tuning" mask="0x00000040" modes="SD_SDIO" name="EXTUN"/>
          <bitfield caption="Sampling Clock Select" mask="0x00000080" modes="SD_SDIO" name="SCLKSEL"/>
          <bitfield caption="Asynchronous Interrupt Enable" mask="0x00004000" modes="SD_SDIO" name="ASINTEN"/>
          <bitfield caption="Preset Value Enable" mask="0x00008000" modes="SD_SDIO" name="PVALEN"/>
          <bitfield caption="HS200 Mode Enable" mask="0x0000000F" modes="E_MMC" name="HS200EN"/>
          <bitfield caption="Driver Strength Select" mask="0x00000030" modes="E_MMC" name="DRVSEL" values="SDMMC_HC2R_E_MMC__DRVSEL"/>
          <bitfield caption="Execute Tuning" mask="0x00000040" modes="E_MMC" name="EXTUN"/>
          <bitfield caption="Sampling Clock Select" mask="0x00000080" modes="E_MMC" name="SCLKSEL"/>
          <bitfield caption="Preset Value Enable" mask="0x00008000" modes="E_MMC" name="PVALEN"/>
        </register>
        <register caption="Capabilities 0 Register" name="SDMMC_CA0R" offset="0x40" rw="R" size="4">
          <bitfield caption="Timeout Clock Frequency" mask="0x0000003F" name="TEOCLKF"/>
          <bitfield caption="Timeout Clock Unit" mask="0x00000080" name="TEOCLKU"/>
          <bitfield caption="Base Clock Frequency" mask="0x0000FF00" name="BASECLKF"/>
          <bitfield caption="Max Block Length" mask="0x00030000" name="MAXBLKL" values="SDMMC_CA0R__MAXBLKL"/>
          <bitfield caption="8-Bit Support for Embedded Device" mask="0x00040000" name="ED8SUP"/>
          <bitfield caption="ADMA2 Support" mask="0x00080000" name="ADMA2SUP"/>
          <bitfield caption="High Speed Support" mask="0x00200000" name="HSSUP"/>
          <bitfield caption="SDMA Support" mask="0x00400000" name="SDMASUP"/>
          <bitfield caption="Suspend/Resume Support" mask="0x00800000" name="SRSUP"/>
          <bitfield caption="Voltage Support 3.3V" mask="0x01000000" name="V33VSUP"/>
          <bitfield caption="Voltage Support 3.0V" mask="0x02000000" name="V30VSUP"/>
          <bitfield caption="Voltage Support 1.8V" mask="0x04000000" name="V18VSUP"/>
          <bitfield caption="64-Bit System Bus Support" mask="0x10000000" name="SB64SUP"/>
          <bitfield caption="Asynchronous Interrupt Support" mask="0x20000000" name="ASINTSUP"/>
          <bitfield caption="Slot Type" mask="0xC0000000" name="SLTYPE"/>
        </register>
        <register caption="Capabilities 1 Register" name="SDMMC_CA1R" offset="0x44" rw="RW" size="4">
          <bitfield caption="SDR50 Support" mask="0x00000001" name="SDR50SUP"/>
          <bitfield caption="SDR104 Support" mask="0x00000002" name="SDR104SUP"/>
          <bitfield caption="DDR50 Support" mask="0x00000004" name="DDR50SUP"/>
          <bitfield caption="Driver Type A Support" mask="0x00000010" name="DRVASUP"/>
          <bitfield caption="Driver Type C Support" mask="0x00000020" name="DRVCSUP"/>
          <bitfield caption="Driver Type D Support" mask="0x00000040" name="DRVDSUP"/>
          <bitfield caption="Timer Count For Retuning" mask="0x00000F00" name="TCNTRT"/>
          <bitfield caption="Use Tuning for SDR50" mask="0x00002000" name="TSDR50"/>
          <bitfield caption="Retuning Modes" mask="0x0000C000" name="RTMOD" values="SDMMC_CA1R__RTMOD"/>
          <bitfield caption="Clock Multiplier" mask="0x00FF0000" name="CLKMULT"/>
        </register>
