Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D22.atdf
        <register caption="UTMI DP/DM Pin Swapping Register" name="SFR_UTMISWAP" offset="0x3C" rw="RW" size="4">
          <bitfield caption="PORT 0 DP/DM Pin Swapping" mask="0x00000001" name="PORT0" values="SFR_UTMISWAP__PORT0"/>
          <bitfield caption="PORT 1 DP/DM Pin Swapping" mask="0x00000002" name="PORT1" values="SFR_UTMISWAP__PORT1"/>
          <bitfield caption="PORT 2 DP/DM Pin Swapping" mask="0x00000004" name="PORT2" values="SFR_UTMISWAP__PORT2"/>
        </register>
        <register caption="CAN Memories Address-based Register" name="SFR_CAN" offset="0x48" rw="RW" size="4">
          <bitfield caption="MSB CAN0 DMA Base Address" mask="0x0000FFFF" name="EXT_MEM_CAN0_ADDR"/>
          <bitfield caption="MSB CAN1 DMA Base Address" mask="0xFFFF0000" name="EXT_MEM_CAN1_ADDR"/>
        </register>
        <register caption="Serial Number 0 Register" name="SFR_SN0" offset="0x4C" rw="R" size="4">
          <bitfield caption="Serial Number 0" mask="0xFFFFFFFF" name="SN0"/>
        </register>
        <register caption="Serial Number 1 Register" name="SFR_SN1" offset="0x50" rw="R" size="4">
          <bitfield caption="Serial Number 1" mask="0xFFFFFFFF" name="SN1"/>
        </register>
        <register caption="AIC Interrupt Redirection Register" name="SFR_AICREDIR" offset="0x54" rw="RW" size="4">
          <bitfield caption="Interrupt Redirection to Non-Secure AIC" mask="0x00000001" name="NSAIC"/>
          <bitfield caption="Unlock Key" mask="0xFFFFFFFE" name="AICREDIRKEY"/>
        </register>
        <register caption="L2CC_HRAMC1" name="SFR_L2CC_HRAMC" offset="0x58" rw="RW" size="4">
          <bitfield caption="SRAM Selector" mask="0x00000001" name="SRAM_SEL"/>
        </register>
        <register caption="I2SC Register" name="SFR_I2SCLKSEL" offset="0x90" rw="RW" size="4">
          <bitfield caption="Clock Selection 0" mask="0x00000001" name="CLKSEL0"/>
          <bitfield caption="Clock Selection 1" mask="0x00000002" name="CLKSEL1"/>
        </register>
        <register caption="QSPI Clock Pad Supply Select Register" name="QSPICLK_REG" offset="0x94" rw="RW" size="4">
          <bitfield caption="Supply Selection" mask="0x00000001" name="SUP_SEL"/>
        </register>
      </register-group>
      <value-group caption="UTMI Reference Clock Frequency" name="SFR_UTMICKTRIM__FREQ">
        <value caption="12 MHz reference clock" name="_12" value="0x0"/>
        <value caption="16 MHz reference clock" name="_16" value="0x1"/>
        <value caption="24 MHz reference clock" name="_24" value="0x2"/>
      </value-group>
      <value-group caption="PORT 0 DP/DM Pin Swapping" name="SFR_UTMISWAP__PORT0">
        <value caption="DP/DM normal pinout." name="NORMAL" value="0"/>
        <value caption="DP/DM swapped pinout." name="SWAPPED" value="1"/>
      </value-group>
      <value-group caption="PORT 1 DP/DM Pin Swapping" name="SFR_UTMISWAP__PORT1">
        <value caption="DP/DM normal pinout." name="NORMAL" value="0"/>
        <value caption="DP/DM swapped pinout." name="SWAPPED" value="1"/>
      </value-group>
      <value-group caption="PORT 2 DP/DM Pin Swapping" name="SFR_UTMISWAP__PORT2">
        <value caption="DP/DM normal pinout." name="NORMAL" value="0"/>
        <value caption="DP/DM swapped pinout." name="SWAPPED" value="1"/>
      </value-group>
    </module>
    <module caption="Special Function Registers Backup" id="44053" name="SFRBU" version="B">
      <register-group name="SFRBU">
        <register caption="Power Switch BU Control Register" name="SFRBU_PSWBUCTRL" offset="0x00" rw="RW" size="4">
          <bitfield caption="Power Switch BU Software Control" mask="0x00000001" name="SCTRL"/>
          <bitfield caption="Power Switch BU Source Selection" mask="0x00000002" name="SSWCTRL"/>
          <bitfield caption="Allow Power Switch BU Control by Security Module Autobackup (Hardware)" mask="0x00000004" name="SMCTRL"/>
          <bitfield caption="Power Switch BU state (Read-only)" mask="0x00000008" name="STATE"/>
          <bitfield mask="0xFFFFFF00" name="KEYPSWMODE"/>
        </register>
        <register caption="TS Range Configuration Register" name="SFRBU_TSRANGECFG" offset="0x04" rw="RW" size="4">
          <bitfield caption="Temperature Sensor Range Selection" mask="0x00000001" name="TSHRSEL"/>
        </register>
        <register caption="DDR BU Mode Control Register" name="SFRBU_DDRBUMCR" offset="0x10" rw="RW" size="4">
          <bitfield caption="DDR BU Mode Enable" mask="0x00000001" name="BUMEN"/>
        </register>
        <register caption="RXLP Pull-Up Control Register" name="SFRBU_RXLPPUCR" offset="0x14" rw="RW" size="4">
          <bitfield caption="RXLP RXD Pull-Up Control" mask="0x00000001" name="RXDPUCTRL"/>
        </register>
      </register-group>
    </module>
    <module caption="Secure Hash Algorithm" id="6156" name="SHA" version="O">
      <register-group name="SHA">
        <register caption="Control Register" name="SHA_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="First Block of a Message" mask="0x00000010" name="FIRST"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
          <bitfield caption="Write User Initial Hash Values" mask="0x00001000" name="WUIHV"/>
          <bitfield caption="Write User Initial or Expected Hash Values" mask="0x00002000" name="WUIEHV"/>
        </register>
        <register caption="Mode Register" name="SHA_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Start Mode" mask="0x00000003" name="SMOD" values="SHA_MR__SMOD"/>
          <bitfield caption="Processing Delay" mask="0x00000010" name="PROCDLY" values="SHA_MR__PROCDLY"/>
          <bitfield caption="User Initial Hash Value Registers" mask="0x00000020" name="UIHV"/>
          <bitfield caption="User Initial or Expected Hash Value Registers" mask="0x00000040" name="UIEHV"/>
          <bitfield caption="SHA Algorithm" mask="0x00000F00" name="ALGO" values="SHA_MR__ALGO"/>
          <bitfield caption="Dual Input Buffer" mask="0x00010000" name="DUALBUFF" values="SHA_MR__DUALBUFF"/>
          <bitfield caption="Hash Check" mask="0x03000000" name="CHECK" values="SHA_MR__CHECK"/>
          <bitfield caption="Check Counter" mask="0xF0000000" name="CHKCNT"/>
        </register>
        <register caption="Interrupt Enable Register" name="SHA_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Enable" mask="0x00010000" name="CHECKF"/>
        </register>
        <register caption="Interrupt Disable Register" name="SHA_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Disable" mask="0x00010000" name="CHECKF"/>
        </register>
        <register caption="Interrupt Mask Register" name="SHA_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Mask" mask="0x00010000" name="CHECKF"/>
        </register>
        <register caption="Interrupt Status Register" name="SHA_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared by writing a 1 to bit SWRST or START in SHA_CR, or by reading SHA_IODATARx)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Input Data Register Write Ready" mask="0x00000010" name="WRDY"/>
          <bitfield caption="Unspecified Register Access Detection Status (cleared by writing a 1 to SWRST bit in SHA_CR)" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access Type (cleared by writing a 1 to SWRST bit in SHA_CR)" mask="0x00007000" name="URAT"/>
          <bitfield caption="Check Done Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Check Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)" mask="0x00F00000" name="CHKST"/>
        </register>
        <register caption="Message Size Register" name="SHA_MSR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Message Size" mask="0xFFFFFFFF" name="MSGSIZE"/>
        </register>
