Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D22.atdf
        <register caption="Interrupt Disable Register" name="TC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:TC_IMR">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Mask Register" name="TC_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:TC_IMR">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Extended Mode Register" name="TC_EMR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Trigger Source for Input A" mask="0x00000003" name="TRIGSRCA" values="TC_EMR0__TRIGSRCA"/>
          <bitfield caption="Trigger Source for Input B" mask="0x00000030" name="TRIGSRCB" values="TC_EMR0__TRIGSRCB"/>
          <bitfield caption="No Divided Clock" mask="0x00000100" name="NODIVCLK"/>
        </register>
      </register-group>
      <register-group name="TC">
        <register-group count="3" name="TC_CHANNEL" name-in-module="TC_CHANNEL" offset="0x0" size="64"/>
        <register caption="Block Control Register" name="TC_BCR" offset="0xC0" rw="W" size="4">
          <bitfield caption="Synchro Command" mask="0x00000001" name="SYNC"/>
        </register>
        <register caption="Block Mode Register" name="TC_BMR" offset="0xC4" rw="RW" size="4">
          <bitfield caption="External Clock Signal 0 Selection" mask="0x00000003" name="TC0XC0S" values="TC_BMR__TC0XC0S"/>
          <bitfield caption="External Clock Signal 1 Selection" mask="0x0000000C" name="TC1XC1S" values="TC_BMR__TC1XC1S"/>
          <bitfield caption="External Clock Signal 2 Selection" mask="0x00000030" name="TC2XC2S" values="TC_BMR__TC2XC2S"/>
          <bitfield caption="Quadrature Decoder Enabled" mask="0x00000100" name="QDEN"/>
          <bitfield caption="Position Enabled" mask="0x00000200" name="POSEN"/>
          <bitfield caption="Speed Enabled" mask="0x00000400" name="SPEEDEN"/>
          <bitfield caption="Quadrature Decoding Transparent" mask="0x00000800" name="QDTRANS"/>
          <bitfield caption="Edge on PHA Count Mode" mask="0x00001000" name="EDGPHA"/>
          <bitfield caption="Inverted PHA" mask="0x00002000" name="INVA"/>
          <bitfield caption="Inverted PHB" mask="0x00004000" name="INVB"/>
          <bitfield caption="Inverted Index" mask="0x00008000" name="INVIDX"/>
          <bitfield caption="Swap PHA and PHB" mask="0x00010000" name="SWAP"/>
          <bitfield caption="Index Pin is PHB Pin" mask="0x00020000" name="IDXPHB"/>
          <bitfield caption="AutoCorrection of missing pulses" mask="0x00040000" name="AUTOC" values="TC_BMR__AUTOC"/>
          <bitfield caption="Maximum Filter" mask="0x03F00000" name="MAXFILT"/>
          <bitfield caption="Maximum Consecutive Missing Pulses" mask="0x3C000000" name="MAXCMP"/>
        </register>
        <register caption="QDEC Interrupt Enable Register" name="TC_QIER" offset="0xC8" rw="W" size="4" atomic-op="set:TC_QIMR">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Consecutive Missing Pulse Error" mask="0x00000008" name="MPE"/>
        </register>
        <register caption="QDEC Interrupt Disable Register" name="TC_QIDR" offset="0xCC" rw="W" size="4" atomic-op="clear:TC_QIMR">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Consecutive Missing Pulse Error" mask="0x00000008" name="MPE"/>
        </register>
        <register caption="QDEC Interrupt Mask Register" name="TC_QIMR" offset="0xD0" rw="R" size="4" atomic-op="read:TC_QIMR">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Consecutive Missing Pulse Error" mask="0x00000008" name="MPE"/>
        </register>
        <register caption="QDEC Interrupt Status Register" name="TC_QISR" offset="0xD4" rw="R" size="4" atomic-op="clear:TC_QISR">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Consecutive Missing Pulse Error" mask="0x00000008" name="MPE"/>
          <bitfield caption="Direction" mask="0x00000100" name="DIR"/>
        </register>
        <register caption="Fault Mode Register" name="TC_FMR" offset="0xD8" rw="RW" size="4">
          <bitfield caption="Enable Compare Fault Channel 0" mask="0x00000001" name="ENCF0"/>
          <bitfield caption="Enable Compare Fault Channel 1" mask="0x00000002" name="ENCF1"/>
        </register>
        <register caption="Write Protection Mode Register" name="TC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="TC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Clock Selection" name="TC_CMR0__TCCLKS">
        <value caption="Clock selected: internal GCLK [35], GCLK [36] clock signal (from PMC)" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: internal System bus clock divided by 8 clock signal (from PMC)" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: internal System bus clock divided by 32 clock signal (from PMC)" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: internal System bus clock divided by 128 clock signal (from PMC)" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: internal slow_clock clock signal (from PMC)" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="Burst Signal Selection" name="TC_CMR0__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="External Trigger Edge Selection" name="TC_CMR0__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="RA Loading Edge Selection" name="TC_CMR0__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOAx" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOAx" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOAx" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="RB Loading Edge Selection" name="TC_CMR0__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOAx" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOAx" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOAx" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="Loading Edge Subsampling Ratio" name="TC_CMR0__SBSMPLR">
        <value caption="Load a Capture register each selected edge" name="ONE" value="0x0"/>
        <value caption="Load a Capture register every 2 selected edges" name="HALF" value="0x1"/>
        <value caption="Load a Capture register every 4 selected edges" name="FOURTH" value="0x2"/>
        <value caption="Load a Capture register every 8 selected edges" name="EIGHTH" value="0x3"/>
        <value caption="Load a Capture register every 16 selected edges" name="SIXTEENTH" value="0x4"/>
      </value-group>
      <value-group caption="External Event Edge Selection" name="TC_CMR0__EEVTEDG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Selection" name="TC_CMR0__EEVT">
        <value caption="TIOB" name="TIOB" value="0x0"/>
        <value caption="XC0" name="XC0" value="0x1"/>
        <value caption="XC1" name="XC1" value="0x2"/>
        <value caption="XC2" name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="Waveform Selection" name="TC_CMR0__WAVSEL">
        <value caption="UP mode without automatic trigger on RC Compare" name="UP" value="0x0"/>
        <value caption="UPDOWN mode without automatic trigger on RC Compare" name="UPDOWN" value="0x1"/>
        <value caption="UP mode with automatic trigger on RC Compare" name="UP_RC" value="0x2"/>
        <value caption="UPDOWN mode with automatic trigger on RC Compare" name="UPDOWN_RC" value="0x3"/>
      </value-group>
      <value-group caption="RA Compare Effect on TIOAx" name="TC_CMR0__ACPA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
