Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D22.atdf
        <register caption="Internal Address Register" name="TWIHS_IADR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Internal Address" mask="0x00FFFFFF" name="IADR"/>
        </register>
        <register caption="Clock Waveform Generator Register" name="TWIHS_CWGR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Clock Low Divider" mask="0x000000FF" name="CLDIV"/>
          <bitfield caption="Clock High Divider" mask="0x0000FF00" name="CHDIV"/>
          <bitfield caption="Clock Divider" mask="0x00070000" name="CKDIV"/>
          <bitfield caption="Transfer Rate Clock Source" mask="0x00100000" name="CKSRC" values="TWIHS_CWGR__CKSRC"/>
          <bitfield caption="TWD Hold Time Versus TWCK Falling" mask="0x1F000000" name="HOLD"/>
        </register>
        <register caption="Status Register" name="TWIHS_SR" offset="0x20" rw="R" size="4">
          <mode name="DEFAULT" qualifier="TWIHS_CR.FIFOEN" value="0"/>
          <mode name="FIFO_ENABLED" qualifier="TWIHS_CR.FIFOEN" value="1"/>
          <bitfield caption="Transmission Completed (cleared by writing TWIHS_THR)" mask="0x00000001" modes="DEFAULT" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready (cleared by reading TWIHS_RHR)" mask="0x00000002" modes="DEFAULT" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready (cleared by writing TWIHS_THR)" mask="0x00000004" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Slave Read" mask="0x00000008" modes="DEFAULT" name="SVREAD"/>
          <bitfield caption="Slave Access" mask="0x00000010" modes="DEFAULT" name="SVACC"/>
          <bitfield caption="General Call Access (cleared on read)" mask="0x00000020" modes="DEFAULT" name="GACC"/>
          <bitfield caption="Overrun Error (cleared on read)" mask="0x00000040" modes="DEFAULT" name="OVRE"/>
          <bitfield caption="Underrun Error (cleared on read)" mask="0x00000080" modes="DEFAULT" name="UNRE"/>
          <bitfield caption="Not Acknowledged (cleared on read)" mask="0x00000100" modes="DEFAULT" name="NACK"/>
          <bitfield caption="Arbitration Lost (cleared on read)" mask="0x00000200" modes="DEFAULT" name="ARBLST"/>
          <bitfield caption="Clock Wait State" mask="0x00000400" modes="DEFAULT" name="SCLWS"/>
          <bitfield caption="End Of Slave Access (cleared on read)" mask="0x00000800" modes="DEFAULT" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge (cleared on read)" mask="0x00010000" modes="DEFAULT" name="MCACK"/>
          <bitfield caption="Timeout Error (cleared on read)" mask="0x00040000" modes="DEFAULT" name="TOUT"/>
          <bitfield caption="PEC Error (cleared on read)" mask="0x00080000" modes="DEFAULT" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match (cleared on read)" mask="0x00100000" modes="DEFAULT" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match (cleared on read)" mask="0x00200000" modes="DEFAULT" name="SMBHHM"/>
          <bitfield caption="TWIHS Lock due to Frame Errors (cleared by writing a one to bit LOCKCLR in TWIHS_CR)" mask="0x00800000" modes="DEFAULT" name="LOCK"/>
          <bitfield caption="SCL Line Value" mask="0x01000000" modes="DEFAULT" name="SCL"/>
          <bitfield caption="SDA Line Value" mask="0x02000000" modes="DEFAULT" name="SDA"/>
          <bitfield caption="Transmission Completed (cleared by writing TWIHS_THR)" mask="0x00000001" modes="FIFO_ENABLED" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready (cleared by reading TWIHS_RHR)" mask="0x00000002" modes="FIFO_ENABLED" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready (cleared by writing TWIHS_THR)" mask="0x00000004" modes="FIFO_ENABLED" name="TXRDY"/>
          <bitfield caption="Slave Read" mask="0x00000008" modes="FIFO_ENABLED" name="SVREAD"/>
          <bitfield caption="Slave Access" mask="0x00000010" modes="FIFO_ENABLED" name="SVACC"/>
          <bitfield caption="General Call Access (cleared on read)" mask="0x00000020" modes="FIFO_ENABLED" name="GACC"/>
          <bitfield caption="Overrun Error (cleared on read)" mask="0x00000040" modes="FIFO_ENABLED" name="OVRE"/>
          <bitfield caption="Underrun Error (cleared on read)" mask="0x00000080" modes="FIFO_ENABLED" name="UNRE"/>
          <bitfield caption="Not Acknowledged (cleared on read)" mask="0x00000100" modes="FIFO_ENABLED" name="NACK"/>
          <bitfield caption="Arbitration Lost (cleared on read)" mask="0x00000200" modes="FIFO_ENABLED" name="ARBLST"/>
          <bitfield caption="Clock Wait State" mask="0x00000400" modes="FIFO_ENABLED" name="SCLWS"/>
          <bitfield caption="End Of Slave Access (cleared on read)" mask="0x00000800" modes="FIFO_ENABLED" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge (cleared on read)" mask="0x00010000" modes="FIFO_ENABLED" name="MCACK"/>
          <bitfield caption="Timeout Error (cleared on read)" mask="0x00040000" modes="FIFO_ENABLED" name="TOUT"/>
          <bitfield caption="PEC Error (cleared on read)" mask="0x00080000" modes="FIFO_ENABLED" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match (cleared on read)" mask="0x00100000" modes="FIFO_ENABLED" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match (cleared on read)" mask="0x00200000" modes="FIFO_ENABLED" name="SMBHHM"/>
          <bitfield caption="Transmit FIFO Lock" mask="0x00800000" modes="FIFO_ENABLED" name="TXFLOCK"/>
          <bitfield caption="SCL Line Value" mask="0x01000000" modes="FIFO_ENABLED" name="SCL"/>
          <bitfield caption="SDA Line Value" mask="0x02000000" modes="FIFO_ENABLED" name="SDA"/>
        </register>
        <register caption="Interrupt Enable Register" name="TWIHS_IER" offset="0x24" rw="W" size="4" atomic-op="set:TWIHS_IMR">
          <bitfield caption="Transmission Completed Interrupt Enable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Enable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Enable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Enable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Enable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Enable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Enable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Enable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge Interrupt Enable" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Enable" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Enable" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Enable" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Enable" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Interrupt Disable Register" name="TWIHS_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:TWIHS_IMR">
          <bitfield caption="Transmission Completed Interrupt Disable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Disable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Disable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Disable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Disable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Disable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Disable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Disable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge Interrupt Disable" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Disable" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Disable" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Disable" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Disable" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Interrupt Mask Register" name="TWIHS_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:TWIHS_IMR">
          <bitfield caption="Transmission Completed Interrupt Mask" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Mask" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Mask" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Mask" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Mask" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Mask" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Mask" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Mask" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Mask" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge Interrupt Mask" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Mask" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Mask" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Mask" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Mask" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Receive Holding Register" name="TWIHS_RHR" offset="0x30" rw="R" size="4">
          <mode name="DEFAULT" qualifier="TWIHS_CR.FIFOEN" value="0"/>
          <mode name="FIFO_ENABLED" qualifier="TWIHS_CR.FIFOEN" value="1"/>
          <bitfield caption="Master or Slave Receive Holding Data" mask="0x000000FF" modes="DEFAULT" name="RXDATA"/>
          <bitfield caption="Master or Slave Receive Holding Data 0" mask="0x000000FF" modes="FIFO_ENABLED" name="RXDATA0"/>
          <bitfield caption="Master or Slave Receive Holding Data 1" mask="0x0000FF00" modes="FIFO_ENABLED" name="RXDATA1"/>
          <bitfield caption="Master or Slave Receive Holding Data 2" mask="0x00FF0000" modes="FIFO_ENABLED" name="RXDATA2"/>
          <bitfield caption="Master or Slave Receive Holding Data 3" mask="0xFF000000" modes="FIFO_ENABLED" name="RXDATA3"/>
        </register>
        <register caption="Transmit Holding Register" name="TWIHS_THR" offset="0x34" rw="W" size="4">
          <mode name="DEFAULT" qualifier="TWIHS_CR.FIFOEN" value="0"/>
          <mode name="FIFO_ENABLED" qualifier="TWIHS_CR.FIFOEN" value="1"/>
          <bitfield caption="Master or Slave Transmit Holding Data" mask="0x000000FF" modes="DEFAULT" name="TXDATA"/>
          <bitfield caption="Master or Slave Transmit Holding Data 02" mask="0x000000FF" modes="FIFO_ENABLED" name="TXDATA0"/>
          <bitfield caption="Master or Slave Transmit Holding Data 1" mask="0x0000FF00" modes="FIFO_ENABLED" name="TXDATA1"/>
          <bitfield caption="Master or Slave Transmit Holding Data 2" mask="0x00FF0000" modes="FIFO_ENABLED" name="TXDATA2"/>
          <bitfield caption="Master or Slave Transmit Holding Data 3" mask="0xFF000000" modes="FIFO_ENABLED" name="TXDATA3"/>
        </register>
        <register caption="SMBus Timing Register" name="TWIHS_SMBTR" offset="0x38" rw="RW" size="4">
          <bitfield caption="SMBus Clock Prescaler" mask="0x0000000F" name="PRESC"/>
          <bitfield caption="Slave Clock Stretch Maximum Cycles" mask="0x0000FF00" name="TLOWS"/>
          <bitfield caption="Master Clock Stretch Maximum Cycles" mask="0x00FF0000" name="TLOWM"/>
          <bitfield caption="Clock High Maximum Cycles" mask="0xFF000000" name="THMAX"/>
        </register>
        <register caption="Alternative Command Register" name="TWIHS_ACR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Data Length" mask="0x000000FF" name="DATAL"/>
          <bitfield caption="Transfer Direction" mask="0x00000100" name="DIR"/>
          <bitfield caption="PEC Request (SMBus Mode only)" mask="0x00000200" name="PEC"/>
          <bitfield caption="Next Data Length" mask="0x00FF0000" name="NDATAL"/>
          <bitfield caption="Next Transfer Direction" mask="0x01000000" name="NDIR"/>
          <bitfield caption="Next PEC Request (SMBus Mode only)" mask="0x02000000" name="NPEC"/>
        </register>
        <register caption="Filter Register" name="TWIHS_FILTR" offset="0x44" rw="RW" size="4">
          <bitfield caption="RX Digital Filter" mask="0x00000001" name="FILT"/>
          <bitfield caption="PAD Filter Enable" mask="0x00000002" name="PADFEN"/>
          <bitfield caption="PAD Filter Config" mask="0x00000004" name="PADFCFG"/>
          <bitfield caption="Digital Filter Threshold" mask="0x00000700" name="THRES"/>
        </register>
        <register caption="SleepWalking Matching Register" name="TWIHS_SWMR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Slave Address 1" mask="0x0000007F" name="SADR1"/>
          <bitfield caption="Slave Address 2" mask="0x00007F00" name="SADR2"/>
          <bitfield caption="Slave Address 3" mask="0x007F0000" name="SADR3"/>
          <bitfield caption="Data Match" mask="0xFF000000" name="DATAM"/>
        </register>
        <register caption="FIFO Mode Register" name="TWIHS_FMR" offset="0x50" rw="RW" size="4">
          <bitfield caption="Transmitter Ready Mode" mask="0x00000003" name="TXRDYM" values="TWIHS_FMR__TXRDYM"/>
          <bitfield caption="Receiver Ready Mode" mask="0x00000030" name="RXRDYM" values="TWIHS_FMR__RXRDYM"/>
          <bitfield caption="Transmit FIFO Threshold" mask="0x003F0000" name="TXFTHRES"/>
          <bitfield caption="Receive FIFO Threshold" mask="0x3F000000" name="RXFTHRES"/>
        </register>
        <register caption="FIFO Level Register" name="TWIHS_FLR" offset="0x54" rw="R" size="4">
          <bitfield caption="Transmit FIFO Level" mask="0x0000003F" name="TXFL"/>
          <bitfield caption="Receive FIFO Level" mask="0x003F0000" name="RXFL"/>
        </register>
        <register caption="FIFO Status Register" name="TWIHS_FSR" offset="0x60" rw="R" size="4">
          <bitfield caption="Transmit FIFO Empty Flag (cleared on read)" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="Transmit FIFO Full Flag (cleared on read)" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="Transmit FIFO Threshold Flag (cleared on read)" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="Receive FIFO Empty Flag" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="Receive FIFO Full Flag" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="Receive FIFO Threshold Flag" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="Transmit FIFO Pointer Error Flag" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="Receive FIFO Pointer Error Flag" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="FIFO Interrupt Enable Register" name="TWIHS_FIER" offset="0x64" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Enable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Enable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Enable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Enable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Enable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Enable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Enable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Enable" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="FIFO Interrupt Disable Register" name="TWIHS_FIDR" offset="0x68" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Disable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Disable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Disable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Disable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Disable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Disable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Disable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Disable" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="FIFO Interrupt Mask Register" name="TWIHS_FIMR" offset="0x6C" rw="R" size="4">
          <bitfield caption="TXFEF Interrupt Mask" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Mask" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Mask" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Mask" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Mask" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Mask" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Mask" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Mask" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="Debug Register" name="TWIHS_DR" offset="0xD0" rw="R" size="4">
          <bitfield caption="SleepWalking Enable" mask="0x00000001" name="SWEN"/>
          <bitfield caption="Clock Request" mask="0x00000002" name="CLKRQ"/>
          <bitfield caption="SleepWalking Match" mask="0x00000004" name="SWMATCH"/>
          <bitfield caption="Transfer Pending" mask="0x00000008" name="TRP"/>
        </register>
        <register caption="Write Protection Mode Register" name="TWIHS_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="TWIHS_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="TWIHS_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0xFFFFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="Internal Device Address Size" name="TWIHS_MMR__IADRSZ">
        <value caption="No internal device address" name="NONE" value="0x0"/>
        <value caption="One-byte internal device address" name="_1_BYTE" value="0x1"/>
        <value caption="Two-byte internal device address" name="_2_BYTE" value="0x2"/>
        <value caption="Three-byte internal device address" name="_3_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="Transfer Rate Clock Source" name="TWIHS_CWGR__CKSRC">
        <value caption="Peripheral clock is used to generate the TWIHS baud rate." name="PERIPH_CK" value="0"/>
        <value caption="GCLK is used to generate the TWIHS baud rate." name="GCLK" value="1"/>
      </value-group>
